# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [ ]:
#Your code here
import sqlite3
connection = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = connection.cursor()

In [36]:
import pandas as pd

def sql_run(query):
    return pd.DataFrame(cur.execute(query).fetchall())

## Display the names of all the employees in Boston.

In [37]:
#Your code here
sql_run('''SELECT firstName, lastName
                FROM employees
                JOIN offices
                USING(officeCode)
                WHERE city = 'Boston';''')

       0          1
0  Julie   Firrelli
1  Steve  Patterson

## Do any offices have no employees?

In [38]:
#Your code here
sql_run('''SELECT offices.City, COUNT(*)
           FROM employees
           LEFT JOIN offices
           USING(officeCode)
           GROUP BY offices.officeCode;
        ''')

               0  1
0  San Francisco  6
1         Boston  2
2            NYC  2
3          Paris  5
4          Tokyo  2
5         Sydney  4
6         London  2

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [42]:
# Your code here
# Sale results per rep
sql_run('''SELECT e.firstName, e.lastName, SUM(p.amount) as total_sales
           FROM employees e
           JOIN customers c ON e.employeeNumber = salesRepEmployeeNumber
           JOIN payments p USING(customerNumber)
           GROUP BY p.
           ORDER BY total_sales DESC
           LIMIT 10;
            ''')

        0          1          2
0  Gerard  Hernandez  120166.58
1  Gerard  Hernandez  116208.40
2  Leslie   Jennings  111654.40
3    Mami      Nishi  105743.00
4  Leslie   Jennings  101244.59
5  Leslie   Jennings   85559.12
6  Leslie   Jennings   85410.87
7   Barry      Jones   85024.46
8  Leslie   Jennings   83598.04
9    Andy     Fixter   82261.22

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!